In [1]:
# %load  ../basic_imports.py
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Проверка Pandas

In [2]:
data = {
    'name':['John', 'Smith', 'Andrey'], 
    'age':[20, 30, 40],
    'country': ['USA', 'Japan', 'Russia'],
}

df = pd.DataFrame(data)

display(df.info)
print(df.name.to_numpy())

<bound method DataFrame.info of      name  age country
0    John   20     USA
1   Smith   30   Japan
2  Andrey   40  Russia>

['John' 'Smith' 'Andrey']

# Проверка Numpy

In [3]:
import numpy as np

y = np.array([[1, 2], [3, 4]])
print(y)

[[1 2]
 [3 4]]

In [4]:
# Данная строка импортирует библиотеку пандас в вашу среду программирования.
# Без неё все последующие методы не будут работать :)

import pandas as pd 

data = ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'] # Создадим список с данными Series
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'] # Создадим список с индексами Series
s = pd.Series(data, index=labels, name='animals') # Создадим Series, обращаясь к Pandas

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
         'age': [2.5, 3, 0.5, 3, 5, 2, 4.5, 4, 7, 3],
         'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
         'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
print(df)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  3.0       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  4.0       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [5]:
df['animal']

a      cat
b      cat
c    snake
d      dog
e      dog
f      cat
g    snake
h      cat
i      dog
j      dog
Name: animal, dtype: object

In [6]:
df.loc['h':'j']

  animal  age  visits priority
h    cat  4.0       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [7]:
df.iloc[0:5]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  3.0       3      yes
e    dog  5.0       2       no

In [8]:
df[df['age'] > 2]  # фильтрация по условию

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
d    dog  3.0       3      yes
e    dog  5.0       2       no
g  snake  4.5       1       no
h    cat  4.0       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [9]:
df.loc[df['age'] > 2, 'animal']  # фильтрация строк по условию и выбор столбцов

a      cat
b      cat
d      dog
e      dog
g    snake
h      cat
i      dog
j      dog
Name: animal, dtype: object

In [10]:
df_filtered = df[df['animal'] == 'dog']
df_filtered

  animal  age  visits priority
d    dog  3.0       3      yes
e    dog  5.0       2       no
i    dog  7.0       2       no
j    dog  3.0       1       no

In [11]:
df_filtered = df[(df['animal'] == 'dog') & (df['age'] == 3)]
df_filtered

  animal  age  visits priority
d    dog  3.0       3      yes
j    dog  3.0       1       no

In [12]:
df_all = df.loc[:, :]
df_all

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  3.0       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  4.0       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [13]:
df_part = df.loc[['a', 'h'], ['animal', 'visits']]
df_part

  animal  visits
a    cat       1
h    cat       1

In [14]:
result = df.loc[lambda x: x['animal'] == 'dog']
print (result)

  animal  age  visits priority
d    dog  3.0       3      yes
e    dog  5.0       2       no
i    dog  7.0       2       no
j    dog  3.0       1       no

# Загрузка данных в Pandas

In [15]:
path = 'C:\\Users\\Rus\dev\\!DS\DS_lesson\\L1.4\\orders.csv' # Здесь должен быть полный путь к файлу(если он лежит у вас локально) или ссылка
df = pd.read_csv(path) # Считываем наш датафрейм из csv файла
df

          id  order_date ship_mode customer_id     sales
0     100006  2014-09-07  Standard    DK-13375   377.970
1     100090  2014-07-08  Standard    EB-13705   699.192
2     100293  2014-03-14  Standard    NF-18475    91.056
3     100328  2014-01-28  Standard    JC-15340     3.928
4     100363  2014-04-08  Standard    JM-15655    21.376
...      ...         ...       ...         ...       ...
5004  168802  2017-11-03  Standard    JO-15145    18.368
5005  169320  2017-07-23    Second    LH-16900   171.430
5006  169488  2017-09-07     First    AA-10375    56.860
5007  169502  2017-08-28  Standard    MG-17650   113.410
5008  169551  2017-07-07     First    RL-19615  1344.838

[5009 rows x 5 columns]

In [16]:
df['new column'] =  df['sales']+ df['id']
df

          id  order_date ship_mode customer_id     sales  new column
0     100006  2014-09-07  Standard    DK-13375   377.970  100383.970
1     100090  2014-07-08  Standard    EB-13705   699.192  100789.192
2     100293  2014-03-14  Standard    NF-18475    91.056  100384.056
3     100328  2014-01-28  Standard    JC-15340     3.928  100331.928
4     100363  2014-04-08  Standard    JM-15655    21.376  100384.376
...      ...         ...       ...         ...       ...         ...
5004  168802  2017-11-03  Standard    JO-15145    18.368  168820.368
5005  169320  2017-07-23    Second    LH-16900   171.430  169491.430
5006  169488  2017-09-07     First    AA-10375    56.860  169544.860
5007  169502  2017-08-28  Standard    MG-17650   113.410  169615.410
5008  169551  2017-07-07     First    RL-19615  1344.838  170895.838

[5009 rows x 6 columns]

In [17]:
df['new column'] = df['new column'].replace(100383.970, 0)

In [18]:
df

          id  order_date ship_mode customer_id     sales  new column
0     100006  2014-09-07  Standard    DK-13375   377.970       0.000
1     100090  2014-07-08  Standard    EB-13705   699.192  100789.192
2     100293  2014-03-14  Standard    NF-18475    91.056  100384.056
3     100328  2014-01-28  Standard    JC-15340     3.928  100331.928
4     100363  2014-04-08  Standard    JM-15655    21.376  100384.376
...      ...         ...       ...         ...       ...         ...
5004  168802  2017-11-03  Standard    JO-15145    18.368  168820.368
5005  169320  2017-07-23    Second    LH-16900   171.430  169491.430
5006  169488  2017-09-07     First    AA-10375    56.860  169544.860
5007  169502  2017-08-28  Standard    MG-17650   113.410  169615.410
5008  169551  2017-07-07     First    RL-19615  1344.838  170895.838

[5009 rows x 6 columns]

In [19]:
df = df.drop('new column', axis=1) # Указываем axis=1, чтобы удалять столбец, а не строки
df

          id  order_date ship_mode customer_id     sales
0     100006  2014-09-07  Standard    DK-13375   377.970
1     100090  2014-07-08  Standard    EB-13705   699.192
2     100293  2014-03-14  Standard    NF-18475    91.056
3     100328  2014-01-28  Standard    JC-15340     3.928
4     100363  2014-04-08  Standard    JM-15655    21.376
...      ...         ...       ...         ...       ...
5004  168802  2017-11-03  Standard    JO-15145    18.368
5005  169320  2017-07-23    Second    LH-16900   171.430
5006  169488  2017-09-07     First    AA-10375    56.860
5007  169502  2017-08-28  Standard    MG-17650   113.410
5008  169551  2017-07-07     First    RL-19615  1344.838

[5009 rows x 5 columns]

In [20]:
df = df.drop_duplicates() # Удаляет первое вхождение дубликатов данных
df

          id  order_date ship_mode customer_id     sales
0     100006  2014-09-07  Standard    DK-13375   377.970
1     100090  2014-07-08  Standard    EB-13705   699.192
2     100293  2014-03-14  Standard    NF-18475    91.056
3     100328  2014-01-28  Standard    JC-15340     3.928
4     100363  2014-04-08  Standard    JM-15655    21.376
...      ...         ...       ...         ...       ...
5004  168802  2017-11-03  Standard    JO-15145    18.368
5005  169320  2017-07-23    Second    LH-16900   171.430
5006  169488  2017-09-07     First    AA-10375    56.860
5007  169502  2017-08-28  Standard    MG-17650   113.410
5008  169551  2017-07-07     First    RL-19615  1344.838

[5009 rows x 5 columns]

In [21]:
df_filtered = df[(df['sales'] > 100) & (df['sales'] < 300)]
df_filtered

          id  order_date ship_mode customer_id    sales
7     100706  2014-12-16    Second    LE-16810  129.440
14    100972  2014-11-19    Second    DB-13360  166.440
16    101175  2014-12-09  Standard    DM-12955  100.704
18    101364  2014-12-22  Standard    TW-21025  296.712
19    101392  2014-12-07  Standard    AS-10630  269.360
...      ...         ...       ...         ...      ...
4989  165869  2017-07-31  Standard    LS-17200  173.400
4999  167570  2017-12-08  Standard    EG-13900  215.544
5002  168613  2017-10-08  Standard    GM-14440  145.764
5005  169320  2017-07-23    Second    LH-16900  171.430
5007  169502  2017-08-28  Standard    MG-17650  113.410

[1093 rows x 5 columns]

In [22]:
df_no_nulls = df.dropna(inplace=True) # Удаляем все строки с пропусками, axis=0, по умолчанию
df_no_nulls

In [23]:
df_filled = df.fillna(0, inplace=True) # Заполняем пропуски каким-либо значением
df_filled